Repository: Wentong-Liu/SayIt
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# dictionary.add
source: Add Entry
zh_hans: 添加词条

# dictionary.cancel
source: Cancel
zh_hans: 取消

# dictionary.delete
source: Delete
zh_hans: 删除

# dictionary.edit
source: Edit
zh_hans: 编辑

# dictionary.editor.title.edit
source: Edit Entry
zh_hans: 编辑词条

# dictionary.editor.title.new
source: New Entry
zh_hans: 新建词条

# dictionary.empty.hint
source: Add a word that gets misheard — a name, brand, or code term like useEffect. Just say it, and dictation spells it exactly, with the right casing.
zh_hans: 添加容易被听错的词——人名、品牌或代码术语，例如 useEffect。只要说出它，听写就会按准确的拼写和大小写写出来。

# dictionary.empty.title
source: No dictionary entries yet
zh_hans: 暂无词典词条

# dictionary.field.canonical
source: Word
zh_hans: 单词

# dictionary.field.canonical.placeholder
source: e.g. useEffect, BigQuery, 拓荆科技
zh_hans: 例如 useEffect、BigQuery、拓荆科技

# dictionary.field.enabled
source: Enabled
zh_hans: 启用

# dictionary.save
source: Save
zh_hans: 保存

# dictionary.section.entries
source: Entries
zh_hans: 词条

# general.inputDevice
source: Input Device
zh_hans: 输入设备

# general.interactionHint.hold
source: Hold the trigger key to record, release to stop.
zh_hans: 按住触发键开始录音，松开结束。

# general.interactionHint.singleTap
source: Tap the trigger key alone to start, tap again to stop. Holding it with another key (a shortcut) won’t trigger.
zh_hans: 单独单击触发键开始录音，再次单击结束。与其它键同按（即快捷键）不会触发。

# general.interactionHint.toggle
source: Tap the trigger key to start, tap again to stop.
zh_hans: 单击触发键开始录音，再次单击结束。

# general.interactionMode
source: Interaction
zh_hans: 交互方式

# general.micHint.idle
source: Tap “Test Microphone” to check the selected device has input.
zh_hans: 点击「测试麦克风」检查所选设备是否有输入。

# general.micHint.testing
source: Speak into the mic — the level bar reacts to volume.
zh_hans: 对着麦克风说话，电平条会随音量跳动。

# general.micLevel.a11y
source: Microphone input level
zh_hans: 麦克风输入电平

# general.section.interfaceLanguage
source: Interface Language
zh_hans: 界面语言

# general.section.microphone
source: Microphone
zh_hans: 麦克风

# general.section.sound
source: Sound
zh_hans: 声音

# general.section.trigger
source: Trigger
zh_hans: 触发

# general.soundCues
source: Play sound cues
zh_hans: 播放声音提示

# general.soundCues.footer
source: Plays a short chime when dictation starts and stops.
zh_hans: 听写开始和结束时播放短促的提示音。

# general.stopTest
source: Stop Test
zh_hans: 停止测试

# general.systemDefault
source: System Default
zh_hans: 系统默认

# general.systemDefault.named %@
source: System Default (%@)
zh_hans: 系统默认（%@）

# general.testMic
source: Test Microphone
zh_hans: 测试麦克风

# general.triggerKey
source: Trigger Key
zh_hans: 触发键

# general.uiLanguage
source: Language
zh_hans: 语言

# general.uiLanguage.footer
source: Changes the app’s display language. Speech is always auto-detected.
zh_hans: 更改应用的显示语言。语音识别始终自动检测语言。

# hud.cannotStartRecording
source: Cannot start recording
zh_hans: 无法开始录音

# hud.copiedPasteManually
source: Copied to clipboard, please paste manually
zh_hans: 已复制到剪贴板，请手动粘贴

# hud.didNotCatchThat
source: Didn’t catch that, please try again
zh_hans: 没听清，请再说一次

# hud.driftedCopiedPasteManually
source: Focus changed — text copied, please paste manually
zh_hans: 焦点已切换，文本已复制，请手动粘贴

# hud.injectedPolishFailed
source: Inserted (polish failed, used original text)
zh_hans: 已注入（润色失败，使用原文）

# hud.insertedNoPolishAddKey
source: Inserted without polish — add an API key under Settings ▸ Polish.
zh_hans: 已插入（未润色）——请在 设置 ▸ 润色 中添加 API Key。

# hud.insertedNoPolishSignIn
source: Inserted without polish — sign in to ChatGPT under Settings ▸ Polish.
zh_hans: 已插入（未润色）——请在 设置 ▸ 润色 中登录 ChatGPT。

# hud.modelDownloadingPct %d
source: Local model downloading… %d%% — please wait
zh_hans: 本地模型下载中…… %d%%，请稍候

# hud.modelStillPreparing
source: Model is still preparing — try again in a moment
zh_hans: 模型仍在准备中——请稍后再试一次

# hud.needAccessibility
source: Accessibility permission required — enable it in System Settings
zh_hans: 需要辅助功能权限，请在系统设置中开启

# hud.needMicrophone
source: Microphone permission required
zh_hans: 需要麦克风权限

# hud.noLocalModel
source: No local model yet — open Settings ▸ Speech to download (or switch to Cloud).
zh_hans: 尚无本地模型——在 设置 ▸ 语音 中下载（或切换到云端）。

# hud.pastedToCurrentWindow
source: Pasted to the current window
zh_hans: 已粘贴到当前窗口

# hud.stopRecordingFailed
source: Failed to finish recording
zh_hans: 录音结束失败

# hud.transcriberNotReady
source: Transcription not ready — check model/API key
zh_hans: 转写未就绪，请检查模型/密钥

# hud.transcriptionFailed
source: Transcription failed
zh_hans: 转写失败

# hud.unsupportedAudioFormat
source: Unsupported audio format
zh_hans: 音频格式不受支持

# interaction.hold
source: Hold to talk
zh_hans: 按住说话

# interaction.singleTap
source: Single tap
zh_hans: 单击切换

# login.browserDone
source: SayIt: Login complete. You can close this page and return to the app.
zh_hans: SayIt：登录完成，可关闭此页面返回 App。

source: Login cancelled
zh_hans: 登录已取消

# login.exchangeFailed %@
source: Token exchange failed: %@
zh_hans: 换 token 失败：%@

# login.keychainWriteFailed
source: Unable to write to keychain
zh_hans: 无法写入钥匙串

# login.noCode
source: No authorization code in callback
zh_hans: 回调里没有授权码

# login.serverFailed %lld
source: Local loopback server failed to start (port %lld may be in use)
zh_hans: 本地回环服务启动失败（端口 %lld 可能被占用）

# login.stateMismatch
source: State verification failed
zh_hans: state 校验失败

# login.timedOut
source: Login timed out, please try again
zh_hans: 登录超时，请重试

# menu.modelDownloading %d
source: Downloading model… %d%%
zh_hans: 正在下载模型…… %d%%

# menu.modelNotReady
source: Setup needed — local model not downloaded
zh_hans: 需要设置 — 本地模型尚未下载

# menu.quit
source: Quit SayIt
zh_hans: 退出 SayIt

# menu.settings
source: Settings…
zh_hans: 设置…

# model.large-v3-turbo
source: large-v3-turbo (recommended)
zh_hans: large-v3-turbo（推荐）

# notif.modelReady.body
source: The local model is installed — dictation now runs offline.
zh_hans: 本地模型已安装 — 听写现在可离线运行。

# notif.modelReady.title
source: SayIt is ready
zh_hans: SayIt 已就绪

# perm.accessibility
source: Accessibility
zh_hans: 辅助功能

# perm.accessibility.detail
source: Listens for the global trigger key and inserts text into the current app.
zh_hans: 监听全局触发键并把文本注入当前 App。

# perm.footer
source: After changing permissions in System Settings, return to this page to refresh the status.
zh_hans: 在系统设置中更改授权后，请返回此页面刷新状态。

# perm.microphone
source: Microphone
zh_hans: 麦克风

# perm.microphone.detail
source: Records your voice for transcription.
zh_hans: 录制语音用于识别。

# perm.openSettings
source: Open System Settings
zh_hans: 去系统设置

# perm.refresh
source: Refresh Status
zh_hans: 刷新状态

# perm.requestAccess
source: Request Access
zh_hans: 请求授权

# perm.section.status
source: Permission Status
zh_hans: 授权状态

# perm.status.denied
source: Denied
zh_hans: 已拒绝

# perm.status.granted
source: Granted
zh_hans: 已授权

# perm.status.notAsked
source: Not asked
zh_hans: 未询问

# perm.status.notGranted
source: Not granted
zh_hans: 未授权

# perm.status.restricted
source: Restricted
zh_hans: 受限制

# polish.enable
source: Enable AI Polish
zh_hans: 启用 AI 润色

# polish.enable.footer
source: When off, the raw transcription is inserted as-is, without cleanup.
zh_hans: 关闭后直接注入原始识别文本，不做整理。

# polish.keySaved %@
source: %@ key saved
zh_hans: %@ 密钥已保存

# polish.keySaveFailed %@
source: Failed to save %@ key
zh_hans: %@ 密钥保存失败

# polish.loggedIn
source: Signed in to ChatGPT
zh_hans: 已登录 ChatGPT

# polish.loginFailed %@
source: ChatGPT login failed: %@
zh_hans: ChatGPT 登录失败：%@

# polish.loginSucceeded
source: ChatGPT login succeeded
zh_hans: ChatGPT 登录成功

# polish.loggedOut
source: Signed out of ChatGPT
zh_hans: 已退出 ChatGPT 登录

# polish.logoutFailed
source: Sign-out failed
zh_hans: 退出失败

# polish.model
source: Model
zh_hans: 模型

# polish.notLoggedIn
source: Not signed in
zh_hans: 未登录

# polish.openingBrowser
source: Opening browser to authorize ChatGPT…
zh_hans: 正在打开浏览器完成 ChatGPT 授权…

# polish.saveKey
source: Save Key
zh_hans: 保存密钥

# polish.section.credentials
source: Credentials
zh_hans: 凭据

# polish.section.model
source: Model
zh_hans: 模型

# polish.section.style
source: Style
zh_hans: 风格

# polish.signInWithChatGPT
source: Sign in with ChatGPT
zh_hans: 用 ChatGPT 登录

# polish.signOut
source: Sign Out
zh_hans: 退出登录

source: Polish Style
zh_hans: 润色风格

# polish.style.casual
source: Casual
zh_hans: 轻松随意

# polish.style.formal
source: Formal
zh_hans: 正式书面

# polish.style.punctuationOnly
source: Punctuation only
zh_hans: 仅补标点

# polish.style.smart
source: Smart
zh_hans: 智能润色

# provider.chatGPT
source: ChatGPT login
zh_hans: ChatGPT 登录

# stt.cancel
source: Cancel
zh_hans: 取消

# stt.download
source: Download
zh_hans: 下载

# stt.downloaded
source: Downloaded
zh_hans: 已下载

# stt.downloadFailed
source: Download failed
zh_hans: 下载失败

# stt.downloadStatus
source: Download Status
zh_hans: 下载状态

# stt.engine
source: Recognition
zh_hans: 识别方式

# stt.footer.cloud
source: Cloud APIs need an internet connection and a valid key; speed depends on the network.
zh_hans: 云端 API 需要联网与有效密钥，识别速度依赖网络。

# stt.footer.local
source: The model (~1.6 GB) downloads automatically on first launch, then runs offline — completely free.
zh_hans: 本地模型约 1.6 GB，首次启动时自动下载，之后离线运行，完全免费。

# stt.model
source: Model
zh_hans: 模型

# stt.mode.cloud
source: Cloud API
zh_hans: 云端 API

# stt.mode.local
source: Local model
zh_hans: 本地模型

# stt.notDownloaded
source: Not downloaded
zh_hans: 未下载

# stt.redownload
source: Re-download
zh_hans: 重新下载

# stt.retry
source: Retry
zh_hans: 重试

# stt.saveKey
source: Save Key
zh_hans: 保存密钥

# stt.section.cloud
source: Cloud Transcription
zh_hans: 云端转写

# stt.section.engine
source: Recognition Engine
zh_hans: 识别引擎

# stt.section.localModel
source: Local Model
zh_hans: 本地模型

# stt.transcribeModel
source: Transcription Model
zh_hans: 转写模型

# tab.dictionary
source: Dictionary
zh_hans: 词典

# tab.general
source: General
zh_hans: 通用

# tab.permissions
source: Permissions
zh_hans: 权限

# tab.polish
source: Polish
zh_hans: 润色

# tab.stt
source: Speech
zh_hans: 语音识别

# triggerKey.leftCommand
source: Left ⌘
zh_hans: 左⌘

# triggerKey.leftControl
source: Left ⌃
zh_hans: 左⌃

# triggerKey.leftOption
source: Left ⌥
zh_hans: 左⌥

# triggerKey.rightCommand
source: Right ⌘
zh_hans: 右⌘

# triggerKey.rightControl
source: Right ⌃
zh_hans: 右⌃

# triggerKey.rightOption
source: Right ⌥
zh_hans: 右⌥

# polish.apiKeyMissing
source: No API key — polish will be skipped
zh_hans: 未设置 API 密钥 — 将跳过润色

# polish.apiKeySet
source: API key set
zh_hans: 已设置 API 密钥

# polish.setupWarning.apiKey
source: Polish is on but no API key is set — add one, or it will be skipped.
zh_hans: 润色已开启，但尚未设置 API 密钥 — 请添加，否则将跳过润色。

# polish.setupWarning.signIn
source: Polish is on but you’re not signed in to ChatGPT — sign in, or it will be skipped.
zh_hans: 润色已开启，但尚未登录 ChatGPT — 请登录，否则将跳过润色。

# stt.download.sizeNote %@
source: ~%@ · requires a network connection
zh_hans: ~%@ · 需要联网下载

# stt.setupCTA.download
source: Download the local model to start dictating.
zh_hans: 下载本地模型后即可开始听写。
